

let cognitiveFunctionsArabic = [
    {
      name: "Te",
      questions: [
        "أتابع القواعد والإرشادات بدقة.",
        "أستمتع بتنظيم يومي باستخدام قوائم.",
        "أركز على النتائج أكثر من المناقشات.",
        "أحكم بشدة على القرارات السيئة.",
        "أعتمد في قراراتي على الحقائق الواضحة.",
        "أشعر بالرضا عند تنظيم المهام.",
        "أفضل الأهداف المحددة على الغموض.",
        "دائمًا ما أكون مستعدًا بخطة بديلة.",
        "يمكن أن أبدو متسلطًا أحيانًا.",
        "أعمل بجد حتى الإرهاق.",
        "أقدر العدالة أكثر من الاستئنافات العاطفية.",
        "لا أحب العمل مع عدم الكفاءة.",
        "أتحدث بصراحة عند الضرورة.",
        "أقود المجموعات بثقة.",
        "أدفع نفسي لتحقيق المزيد.",
        "أتخذ قرارات سريعة ومبنية على معلومات."
      ],
      score: 0,
      openEnded: {
        question: "عندما تعمل على مشروع جماعي بآراء متضاربة، كيف تتعامل مع اتخاذ القرارات وتضمن سير المشروع بسلاسة؟",
        answer: ""
      }
    },
    {
      name: "Ti",
      questions: [
        "أشكك في السلطات والأفكار كثيرًا.",
        "أستمتع بالنقاشات الفكرية.",
        "أحل الألغاز كتمرين ذهني.",
        "أتعامل مع المشاعر بمنطقية.",
        "لا أمانع في لعب دور محامي الشيطان.",
        "أقدر المنطق والغاية الداخلية.",
        "أحتاج إلى وقت وحدي للتفكير بوضوح.",
        "أقوم بتعديل أفكاري لتتوافق مع الواقع.",
        "أثق بنظم معتقداتي الشخصية أكثر.",
        "أفضل الاستقلالية والحرية.",
        "أحتفظ ببعض الآراء القوية جدًا.",
        "أستمتع بتصنيف الأشياء ذهنيًا.",
        "أعدل أسلوبي لحل المشكلات.",
        "ألاحظ العيوب في المنطق بسرعة.",
        "أنافس نفسي من أجل النمو.",
        "أفكر بعمق قبل شرح الأفكار."
      ],
      score: 0,
      openEnded: {
        question: "هل يمكنك أن تشرح لي كيف تقيم وتعمل على تحسين عملية تبدو غير فعالة؟",
        answer: ""
      }
    },
    {
      name: "Se",
      questions: [
        "ألاحظ التفاصيل الصغيرة بسرعة.",
        "أتعلم جيدًا من التجارب.",
        "أكتشف الفرص في اللحظة.",
        "أتصرف أحيانًا بناءً على اندفاع خالص.",
        "أعتبر نفسي واقعيًا.",
        "أركز على اللحظة الحالية.",
        "أجيد القيادة بانتباه.",
        "أفضل البقاء نشيطًا وغير مستقر.",
        "أحب الأشياء الجذابة بصريًا.",
        "لدي ردود أفعال سريعة بطبيعتي.",
        "أستمتع بشعور الأدرينالين.",
        "أعتمد على حواسي يوميًا.",
        "ألاحظ الأشياء التي يغفلها الآخرون.",
        "أبقى متوازنًا ونادرًا ما أكون أخرق.",
        "أزدهر في البيئات السريعة الإيقاع.",
        "أتجنب التعمق في أفكاري."
      ],
      score: 0,
      openEnded: {
        image: "",
        question: "عند النظر إلى هذه الصورة، ما التفاصيل التي تلاحظها أولاً، وكيف تصف هذا المشهد بالتفصيل؟",
        answer: ""
      }
    },
    {
      name: "Si",
      questions: [
        "أقدر التقاليد والروتين.",
        "ألتزم بالأساليب الموثوقة.",
        "لدي ذاكرة قوية ومفصلة.",
        "أبذل جهدًا كبيرًا لتجنب الأخطاء السابقة.",
        "ألاحظ التغيرات الصغيرة في جسمي.",
        "أستمتع بالتفكير في الماضي.",
        "يمكن أن أكون عنيدًا جدًا أحيانًا.",
        "أركز على التفاصيل الصغيرة أولاً.",
        "أقدر الاستقرار والاتساق.",
        "أتبع التعليمات بعناية.",
        "ألتزم بالروتين والجداول الزمنية.",
        "أرى الحاضر كوقت سريع الزوال.",
        "أقدر الأفكار ذات الاستخدامات العملية.",
        "أثق بالتجربة الشخصية أكثر.",
        "ألاحظ التغيرات في المظاهر.",
        "أحب تنظيم الحقائق والبيانات."
      ],
      score: 0,
      openEnded: {
        question: "هل يمكنك مشاركة تجربة سابقة أو درس ساعدك في حل مشكلة بفعالية؟",
        answer: ""
      }
    },
    {
      name: "Ne",
      questions: [
        "يوصفني الآخرون بأنني غريب وفريد.",
        "أستمتع بالإبداع والابتكار.",
        "أبقي نفسي مستمتعًا بسهولة.",
        "أركز بعمق عندما أكون ملهمًا.",
        "أعمل على توليد الأفكار بشكل أفضل في مجموعات.",
        "أنا فضولي بشأن معظم المواضيع.",
        "أحب العمل على مشاريع جانبية.",
        "أحب استكشاف الاحتمالات الجديدة.",
        "أتنقل بين العديد من الهوايات.",
        "أربط بين أفكار غير مترابطة.",
        "أجد صعوبة في الالتزام بقرارات معينة.",
        "أحل المشكلات بطرق فريدة.",
        "غالبًا ما يكون لدي حماسة طفولية.",
        "أجد صعوبة في اختيار مسار وظيفي واحد.",
        "أستمتع بتعلم أشياء جديدة يوميًا.",
        "أتخيل سيناريوهات المستقبل كثيرًا."
      ],
      score: 0,
      openEnded: {
        question: "فكر في استخدامات متعددة لعلبة صودا فارغة واكتبها.",
        answer: ""
      }
    },
    {
      name: "Ni",
      questions: [
        "أركز على التفكير في الصورة الكبيرة.",
        "ألاحظ الأنماط في الأحداث اليومية.",
        "أستخدم الأفكار المجردة لشرح الأمور.",
        "أحصل على لحظات مفاجئة من الوضوح.",
        "أجد معنى في الرموز غالبًا.",
        "أخطط للمستقبل.",
        "أحتفظ بأفكاري الخاصة عادةً.",
        "أقدم رؤى فريدة بشكل طبيعي.",
        "أجد صعوبة في شرح الأفكار.",
        "دائمًا أسعى لتحسين الذات.",
        "أجرب بدلاً من اتباع المعايير.",
        "أضع استراتيجيات لتحقيق الأهداف.",
        "أفكر بالصور أكثر من الجمل.",
        "أثق بحدسي الداخلي.",
        "أتخيل مسار حياتي على المدى الطويل.",
        "أستعد لاحتمالات المستقبل."
      ],
      score: 0,
      openEnded: {
        question: "عند مواجهة موقف معقد، كيف تحدد الأنماط وتتنبوء بالنتائج المحتملة؟",
        answer: ""
      }
    },
    {
      name: "Fe",
      questions: [
        "أعطي الأولوية لاحتياجات الآخرين على احتياجاتي.",
        "أعرف ما هو مناسب اجتماعيًا.",
        "أقدم الدعم عندما يحتاجه الآخرون.",
        "أستطيع تغيير المزاج في الغرفة.",
        "أفهم دوافع الناس جيدًا.",
        "أنا متعاطف بشكل طبيعي مع الآخرين.",
        "ألاحظ ديناميكيات المجموعة بسرعة.",
        "أشعر بالسوء إذا أزعجت الآخرين.",
        "أهتم بالمدح والنقد.",
        "أحترم التزاماتي تجاه الآخرين.",
        "أعالج العواطف من خلال الحديث بصوت عالٍ.",
        "أحب رد الجميل للمجتمعات.",
        "أرى كيف تؤثر الخيارات على الآخرين.",
        "أشعر بالمسؤولية عن عواطف الآخرين.",
        "أقدر التناغم في المجموعات الاجتماعية.",
        "أحل النزاعات من خلال تعزيز التعاطف."
      ],
      score: 0,
      openEnded: {
        question: "هل يمكنك وصف موقف ساعدت فيه في حل نزاع أو تحسين ديناميكيات الفريق؟",
        answer: ""
      }
    },
    {
      name: "Fi",
      questions: [
        "أفضل الصدق على التصنع.",
        "أشعر بالسوء عند انتقاد الآخرين.",
        "يوصفني الآخرون بأنني صادق ولطيف.",
        "أتبنى القيم الشخصية في قراراتي.",
        "أنا مستغرق في التأمل الذاتي.",
        "أنجذب إلى الفنون الإبداعية كثيرًا.",
        "أخفي أعمق قيمي بداخلي.",
        "أعد قوائم تشغيل بناءً على المزاج.",
        "أشعر بالذنب بشدة عند اللزوم.",
        "أثق بحدسي في القرارات الأخلاقية.",
        "أؤمن بمبدأ 'عش ودع الآخرين يعيشون'.",
        "أتبع قلبي على المعايير الاجتماعية.",
        "أقضي الوقت في الأحلام كثيرًا.",
        "أسعى لتحقيق السلام والانسجام الداخلي.",
        "أشعر بالعواطف بعمق لكن بشكل خاص.",
        "أقدر الروابط القريبة والهادفة."
      ],
      score: 0,
      openEnded: {
        question: "هل يمكنك أن تخبرني عن موقف اتخذت فيه قرارًا خالف التوقعات الخارجية ولكنه كان صحيحًا بالنسبة لك؟",
        answer: ""
      }
    }
  ];

cognitiveFunctionsArabic.map((cognitiveFunction) => {
    cognitiveFunction.openEnded.change = function(answer){
      cognitiveFunction.openEnded.answer = answer;
    }
});
export default cognitiveFunctionsArabic;
